vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G401_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32G401_DFP</name>
    <description>Nsing N32G401 Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="1.0.1">		    
            First release of N32G401_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G401</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G401 Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <description>
The N32G401 series utilizes a 32-bit ARM Cortex-M4F core with operating frequency up to 72MHz. 

- Up to 64KB embedded encrypted Flash memory.
- 8KB SRAM.
- 1x 12bit 5Msps ADC and 1x high-speed comparators
- 4x USART, 2x I2C, 2x SPI, 3x COMP, 1x DMA, 22x PWM, 1x OPA and 2x Beeper	
- RTC, 8x Timer, 30+1 GPOs
- Hardware Cryptographics Engine.
          </description>
  
          <subFamily DsubFamily="N32G401">
		   <processor Dclock="48000000"/>		   
           <compile header="firmware/CMSIS/device/n32g401.h" define="N32G401 USE_STDPERIPH_DRIVER"/>
	  	   <feature type="XTAL"     n="4000000"     m="32000000" name="External Crystal Oscillator"/>		   
	  	   <feature type="VCC"      n="1.80"        m="3.60"/>		
		   <feature type="Temp"     n="-40"        m="105"/>	
		   <feature type="RTC"      n="1"/>		   
		  <!-- *************************  Device 'N32G401C8L7'  ***************************** -->
		  <device Dname="N32G401C8L7"> 
			<description>
- Package:LQFP48
- COMP: 3x		
- Beeper: 1x	
			</description>					
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="40"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="16"     	m="12"  name="16-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G401C8Q7'  ***************************** -->
		  <device Dname="N32G401C8Q7"> 
		  	<description>
- Package:QFN48
- COMP: 3x	
- Beeper: 1x	
			</description>	
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="40"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="10"      m="12"  name="16-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>				
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>

			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G401K8L7'  ***************************** -->
		  <device Dname="N32G401K8L7"> 
		  	<description>
- Package:LQFP32
- COMP: 3x	
- Beeper: 1x			
			</description>		  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>				
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G401K8Q7'  ***************************** -->
		  <device Dname="N32G401K8Q7"> 
		  	<description>
- Package:QFN32
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>				
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G401G8Q7'  ***************************** -->
		  <device Dname="N32G401G8Q7"> 
		  	<description>
- Package:QFN28
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="24"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>		
