vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G401_DFP.pdsc
		 <!-- *************************  Device 'N32G401F8Q7'  ***************************** -->
		  <device Dname="N32G401F8Q7"> 
		  	<description>
- Package:QFN20
- COMP: 3x	
- Beeper: 1x				
			</description>			  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="16"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="7"      m="12"  name="7-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="1"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x2000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G401F8S7'  ***************************** -->
		  <device Dname="N32G401F8S7"> 
		  	<description>
- Package:TSSOP20
- COMP: 3x	
- Beeper: 1x
			</description>			  
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="8" 		name="8KB SRAM"/>	
			<feature type="IOs"      n="16"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="9"      m="12"  name="9-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="1"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G401C6L7'  ***************************** -->
		  <device Dname="N32G401C6L7"> 
		  	<description>
- Package:LQFP48
- COMP: 3x	
- Beeper: 1x		
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 	    name="16KB SRAM"/>	
			<feature type="IOs"      n="40"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>				
			<feature type="ADC"      n="16"      m="12"  name="16-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G401C6Q7'  ***************************** -->
		  <device Dname="N32G401C6Q7"> 
		  	<description>
- Package:QFN48
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 	    name="8KB SRAM"/>	
			<feature type="IOs"      n="40"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>			
			<feature type="ADC"      n="16"      m="12"  name="16-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>
		 <!-- *************************  Device 'N32G401K6L7'  ***************************** -->
		  <device Dname="N32G401K6L7"> 
		  	<description>
- Package:LQFP32
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 	    name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>			
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G401K6Q7'  ***************************** -->
		  <device Dname="N32G401K6Q7"> 
		  	<description>
- Package:QFN32
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 	    name="8KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>			
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G401G6Q7'  ***************************** -->
		  <device Dname="N32G401G6Q7"> 
		  	<description>
- Package:QFN28
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 	    name="8KB SRAM"/>	
			<feature type="IOs"      n="24"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>			
			<feature type="ADC"      n="10"      m="12"  name="10-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
