vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G401_DFP.pdsc
		 <!-- *************************  Device 'N32G401F6Q7'  ***************************** -->
		  <device Dname="N32G401F6Q7"> 
		  	<description>
- Package:QFN20
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 	    name="8KB SRAM"/>	
			<feature type="IOs"      n="16"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>			
			<feature type="ADC"      n="7"      m="12"  name="7-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="1"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G401F6S7'  ***************************** -->
		  <device Dname="N32G401F6S7"> 
		  	<description>
- Package:TSSOP20
- COMP: 3x	
- Beeper: 1x			
			</description>			  
		    <feature type="Memory"   n="32" 	name="32KB Flash"/>	
		    <feature type="Memory"   n="8" 	    name="8KB SRAM"/>	
			<feature type="IOs"      n="16"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="22"/>			
			<feature type="ADC"      n="9"      m="12"  name="9-ch 12bit ADC"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="1"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="DMA"      n="8"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G401.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G401.svd"/>
          </device>		
		  
        </subFamily>
        </family>
    </devices> 

    <conditions>   
		
		<!-- Device Conditions -->
		<condition id="N32G401">
		  <description>NSING N32G401 Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32G401 CMSIS">            
		    <description>NSING N32G401 Device and the ARM compiler</description>
		    <require condition="N32G401"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

		<!-- N32G401 STDPERIPHERALS MISC Conditions -->
        <condition id="N32G401 STDPERIPHERALS">
            <description>NSING N32G401 Standard Peripherals drivers</description>
            <require condition="N32G401 CMSIS"/>
            <require Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="MISC"/>
        </condition>
		
		<!-- N32G401 STDPERIPHERALS RCC Conditions -->
        <condition id="N32G401 STDPERIPHERALS RCC">
            <description>NSING N32G401 Standard Peripherals driver with RCC</description>
            <require condition="N32G401 STDPERIPHERALS"/>
            <require Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="RCC"/>
        </condition>


    </conditions>

    <components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G401 CMSIS">
            <description>Startup File for Nsing N32G401 Series</description>
            <files>
                <file category="include" name="firmware/CMSIS/device/"/>
				<file category="header" name="firmware/CMSIS/device/n32g401.h"/>
				<!-- startup file -->				
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g401.s" attr="config"  version="1.0.0" condition="N32G401 CMSIS"/>
				<!-- system file -->
                <file category="source" name="firmware/CMSIS/device/system_n32g401.c" attr="config" version="1.0.0"/>
				
            </files>
        </component>
		
	    <!-- N32G401_StdPeripherals -->		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="N32G401 CMSIS">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g401_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/misc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_adc.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_adc.c"/>
            </files>
        </component>		

        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="BEEPER" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>BEEPER driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BEEPER
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_beeper.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_beeper.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="COMP" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Comparator (COMP) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_comp.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_comp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>CRC calculation unit (CRC) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_crc.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_crc.c"/>
            </files>
        </component>
		
