vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G401_DFP.pdsc
       <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>MCU debug component (DBG) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_dbg.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_dbg.c"/>
            </files>
        </component>
 
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>DMA controller (DMA) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_dma.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_dma.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>External interrupt/event controller (EXTI) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_exti.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_exti.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="FLASH" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_flash.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>General-purpose I/O (GPIO) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_gpio.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_gpio.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_i2c.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="IWDG" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Independent watchdog (IWDG) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_iwdg.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_iwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="LPTIM" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Low Power Timers (LPTIM) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPTIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_lptim.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_lptim.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="PWR" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Power controller (PWR) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_pwr.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_pwr.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="RCC" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Reset and clock control (RCC) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_rcc.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_rcc.c"/>
            </files>
        </component>

