vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G401_DFP.pdsc
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Real-time clock (RTC) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_rtc.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_rtc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="SPI" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Serial peripheral interface (SPI) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_spi.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_spi.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Timers (TIMER) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_tim.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_tim.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Universal asynchronous receiver transmitter (USART) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_usart.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_usart.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G401_StdPeripherals" Csub="WWDG" Cversion="1.0.0" condition="N32G401 STDPERIPHERALS RCC">
            <description>Window watchdog (WWDG) driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_std_periph_driver/inc/n32g401_wwdg.h"/>
                <file category="source" name="firmware/n32g401_std_periph_driver/src/n32g401_wwdg.c"/>
            </files>
        </component>		

<!-- 		<component Cclass="Device" Cgroup="Algorithm_Libs" Csub="Common" Cversion="1.0.0" condition="N32G401 CMSIS">
		    <description>Algo driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_COMMON
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_algo_lib/inc/n32g401_algo_common.h"/>
                <file category="source" name="firmware/n32g401_algo_lib/lib/n32g401_algo_common.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm_Libs" Csub="AES" Cversion="1.0.0" condition="N32G401 Algorithm Common">
		    <description>AES driver for N32G401</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_algo_lib/inc/n32g401_aes.h"/>
                <file category="source" name="firmware/n32g401_algo_lib/lib/n32g401_aes.lib"/>
            </files>
        </component>
 
        <component Cclass="Device" Cgroup="Algorithm_Libs" Csub="DES" Cversion="1.0.0" condition="N32G401 Algorithm Common">
		    <description>DES driver for N32G401</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_DES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_algo_lib/inc/n32g401_des.h"/>
                <file category="source" name="firmware/n32g401_algo_lib/lib/n32g401_des.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm_Libs" Csub="HASH" Cversion="1.0.0" condition="N32G401 Algorithm Common">
		    <description>HASH driver for N32G401</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_HASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g401_algo_lib/inc/n32g401_hash.h"/>
                <file category="source" name="firmware/n32g401_algo_lib/lib/n32g401_hash.lib"/>
            </files>
        </component>  -->

		
    </components>
</package>
